#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/son-org/son-workspace/runs/run-n5aeWmZ2WFAXnTyx

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.glue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "glue:*",
              + "iam:GetRole",
              + "iam:GetRolePolicy",
              + "iam:ListRolePolicies",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
              + "logs:PutRetentionPolicy",
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.read_s3_user will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "read_s3_user" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetObject"
        }
    }

  # aws_cloudwatch_log_group.glue_job will be created
  + resource "aws_cloudwatch_log_group" "glue_job" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "glue-job"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_glue_catalog_database.user will be created
  + resource "aws_glue_catalog_database" "user" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "Database for user data"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "user"
    }

  # aws_glue_crawler.user_database_crawler will be created
  + resource "aws_glue_crawler" "user_database_crawler" {
      + arn           = (known after apply)
      + database_name = "user"
      + description   = "Crawler to update tables in the user database of the glue data catalog"
      + id            = (known after apply)
      + name          = "user-database-crawler"
      + role          = (known after apply)
      + schedule      = "cron(30 21 * * ? *)"
      + tags          = {
          + "Application" = "GlueCrawler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user-database-crawler"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "GlueCrawler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user-database-crawler"
          + "Owner"       = "Son"
        }

      + s3_target {
          + path = "s3://user/age"
        }
      + s3_target {
          + path = "s3://user/gender"
        }
      + s3_target {
          + path = "s3://user/interests"
        }
    }

  # aws_glue_job.export_processed_age_data_to_s3 will be created
  + resource "aws_glue_job" "export_processed_age_data_to_s3" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--ENV"                              = "dev"
          + "--continuous-log-logGroup"          = "glue-job"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
        }
      + description       = "Process user's age data and upload to s3"
      + glue_version      = "4.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "export-processed-age-data-to-s3"
      + number_of_workers = 2
      + role_arn          = (known after apply)
      + tags              = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-age-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all          = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-age-data-to-s3"
          + "Owner"       = "Son"
        }
      + timeout           = 2880
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + script_location = "s3://user/job/export_processed_age_data_to_s3.py"
        }
    }

  # aws_glue_job.export_processed_gender_data_to_s3 will be created
  + resource "aws_glue_job" "export_processed_gender_data_to_s3" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--ENV"                              = "dev"
          + "--continuous-log-logGroup"          = "glue-job"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
        }
      + description       = "Process user's gender data and upload to s3"
      + glue_version      = "4.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "export-processed-gender-data-to-s3"
      + number_of_workers = 5
      + role_arn          = (known after apply)
      + tags              = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-gender-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all          = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-gender-data-to-s3"
          + "Owner"       = "Son"
        }
      + timeout           = 2880
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + script_location = "s3://user/job/export_processed_gender_data_to_s3.py"
        }
    }

  # aws_glue_job.export_processed_interests_data_to_s3 will be created
  + resource "aws_glue_job" "export_processed_interests_data_to_s3" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--ENV"                                     = "dev"
          + "--TempDir"                                 = "s3://user/shuffle/"
          + "--conf spark.shuffle.glue.s3ShuffleBucket" = "s3://user"
          + "--continuous-log-logGroup"                 = "glue-job"
          + "--enable-continuous-cloudwatch-log"        = "true"
          + "--enable-continuous-log-filter"            = "true"
          + "--enable-metrics"                          = "true"
          + "--write-shuffle-files-to-s3"               = "true"
          + "--write-shuffle-spills-to-s3"              = "true"
        }
      + description       = "Generate interest data from user attribute information and upload to s3"
      + glue_version      = "2.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "export-processed-interests-data-to-s3"
      + number_of_workers = 30
      + role_arn          = (known after apply)
      + tags              = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-interests-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all          = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-interests-data-to-s3"
          + "Owner"       = "Son"
        }
      + timeout           = 2880
      + worker_type       = "G.2X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + script_location = "s3://user/job/export_processed_interests_data_to_s3.py"
        }
    }

  # aws_glue_job.notify_workflow_status will be created
  + resource "aws_glue_job" "notify_workflow_status" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--ENV"                              = "dev"
          + "--continuous-log-logGroup"          = "glue-job"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--slack_webhook_url"                = "https://hooks.slack.com/services/hoge/fuga/bar"
        }
      + description       = "Notify workflow status"
      + glue_version      = "4.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "notify-workflow-status"
      + number_of_workers = 2
      + role_arn          = (known after apply)
      + tags              = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "notify-workflow-status"
          + "Owner"       = "Son"
        }
      + tags_all          = {
          + "Application" = "GlueJob"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "notify-workflow-status"
          + "Owner"       = "Son"
        }
      + timeout           = 2880
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + script_location = "s3://user/job/notify_workflow_status.py"
        }
    }

  # aws_glue_trigger.export_processed_age_data_to_s3 will be created
  + resource "aws_glue_trigger" "export_processed_age_data_to_s3" {
      + arn           = (known after apply)
      + description   = "Triggers a job to process user age data and upload to s3 based on a schedule"
      + enabled       = true
      + id            = (known after apply)
      + name          = "export-processed-age-data-to-s3"
      + schedule      = "cron(0 22 * * ? *)"
      + state         = (known after apply)
      + tags          = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-age-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-age-data-to-s3"
          + "Owner"       = "Son"
        }
      + type          = "SCHEDULED"
      + workflow_name = "user"

      + actions {
          + job_name = "export-processed-age-data-to-s3"
        }
    }

  # aws_glue_trigger.export_processed_gender_data_to_s3 will be created
  + resource "aws_glue_trigger" "export_processed_gender_data_to_s3" {
      + arn           = (known after apply)
      + description   = "Triggers a job to process user gender data and upload to s3 based on status of the previous job"
      + enabled       = true
      + id            = (known after apply)
      + name          = "export-processed-gender-data-to-s3"
      + state         = (known after apply)
      + tags          = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-gender-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-gender-data-to-s3"
          + "Owner"       = "Son"
        }
      + type          = "CONDITIONAL"
      + workflow_name = "user"

      + actions {
          + job_name = "export-processed-gender-data-to-s3"
        }

      + predicate {
          + logical = "AND"

          + conditions {
              + job_name         = "export-processed-age-data-to-s3"
              + logical_operator = "EQUALS"
              + state            = "SUCCEEDED"
            }
        }
    }

  # aws_glue_trigger.export_processed_interests_data_to_s3 will be created
  + resource "aws_glue_trigger" "export_processed_interests_data_to_s3" {
      + arn           = (known after apply)
      + description   = "Triggers a job to process user interests data and upload to s3 based on status of the previous job"
      + enabled       = true
      + id            = (known after apply)
      + name          = "export-processed-interests-data-to-s3"
      + state         = (known after apply)
      + tags          = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-interests-data-to-s3"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "export-processed-interests-data-to-s3"
          + "Owner"       = "Son"
        }
      + type          = "CONDITIONAL"
      + workflow_name = "user"

      + actions {
          + job_name = "export-processed-interests-data-to-s3"
        }

      + predicate {
          + logical = "AND"

          + conditions {
              + job_name         = "export-processed-gender-data-to-s3"
              + logical_operator = "EQUALS"
              + state            = "SUCCEEDED"
            }
        }
    }

  # aws_glue_trigger.notify_workflow_status will be created
  + resource "aws_glue_trigger" "notify_workflow_status" {
      + arn           = (known after apply)
      + description   = "Triggers a notification job when one of the workflow jobs fails"
      + enabled       = true
      + id            = (known after apply)
      + name          = "notify-workflow-status"
      + state         = (known after apply)
      + tags          = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "notify-workflow-status"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "GlueTrigger"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "notify-workflow-status"
          + "Owner"       = "Son"
        }
      + type          = "CONDITIONAL"
      + workflow_name = "user"

      + actions {
          + job_name = "notify-workflow-status"
        }

      + predicate {
          + logical = "ANY"

          + conditions {
              + job_name         = "export-processed-age-data-to-s3"
              + logical_operator = "EQUALS"
              + state            = "FAILED"
            }
          + conditions {
              + job_name         = "export-processed-gender-data-to-s3"
              + logical_operator = "EQUALS"
              + state            = "FAILED"
            }
          + conditions {
              + job_name         = "export-processed-interests-data-to-s3"
              + logical_operator = "EQUALS"
              + state            = "FAILED"
            }
        }
    }

  # aws_glue_workflow.user will be created
  + resource "aws_glue_workflow" "user" {
      + arn         = (known after apply)
      + description = "Execute ETL jos against user data"
      + id          = (known after apply)
      + name        = "user"
      + tags        = {
          + "Application" = "GlueWorkflow"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
      + tags_all    = {
          + "Application" = "GlueWorkflow"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
    }

  # aws_iam_policy.glue will be created
  + resource "aws_iam_policy" "glue" {
      + arn         = (known after apply)
      + description = "Policy for AWS Glue crawler and job access to resources"
      + id          = (known after apply)
      + name        = "glue"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.glue will be created
  + resource "aws_iam_role" "glue" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.glue will be created
  + resource "aws_iam_role_policy_attachment" "glue" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue-service-role"
    }

  # aws_iam_user.read_s3_user will be created
  + resource "aws_iam_user" "read_s3_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "read-s3-user"
      + path          = "/"
      + tags          = {
          + "Application" = "IAMUser"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "read-s3-user"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "IAMUser"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "read-s3-user"
          + "Owner"       = "Son"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.read_s3_user_policy will be created
  + resource "aws_iam_user_policy" "read_s3_user_policy" {
      + id     = (known after apply)
      + name   = "read-s3-user-policy"
      + policy = (known after apply)
      + user   = "read-s3-user"
    }

  # aws_s3_bucket.user will be created
  + resource "aws_s3_bucket" "user" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "user"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "S3Bucket"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
      + tags_all                    = {
          + "Application" = "S3Bucket"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @sonkibon, Action: `pull_request`*